app/views/admin/rooms/_form.html.haml

  = f.label "Room Type  :"
  = f.collection_select :room_type_id, RoomType.all, :id, :name, {:selected => f.object.room_type_id, :prompt => "select room type"}
---
SELECT `room_types`.* FROM `room_types`