app/controllers/admin/bookings_controller.rb

  def index
    @bookings = Booking.includes(:user,:room).order("created_at desc")
---
SELECT `bookings`.* FROM `bookings`  ORDER BY created_at desc
SELECT `rooms`.* FROM `rooms` WHERE `rooms`.`id` IN (2, 1, 4)
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (2)