app/controllers/admin/rooms_controller.rb

SELECT `room_types`.* FROM `room_types` WHERE `room_types`.`id` IN (1, 3, 2)
SELECT `rooms`.* FROM `rooms`  ORDER BY created_at desc
---
  def index
    @rooms = Room.includes(:room_type).order("created_at desc")

INSERT INTO `rooms` (`room_no`, `room_type_id`, `created_at`, `updated_at`) VALUES ('12', 4, '2016-05-21 06:08:07', '2016-05-21 06:08:07')
---
  def create
    @room = Room.new(room_params)
    if @room.save

SELECT  `rooms`.* FROM `rooms` WHERE `rooms`.`id` = NULL LIMIT 1
---
  def find_room
    @room_type = Room.find(params[:id]) rescue nil