app/controllers/admin/room_types_controller.rb

SELECT `room_types`.* FROM `room_types`  ORDER BY created_at desc
---
  def index
    @room_types = RoomType.all.order("created_at desc")

INSERT INTO `room_types` (`name`, `detail`, `price`, `created_at`, `updated_at`) VALUES ('A', 'A', 1000, '2016-05-21 06:44:59', '2016-05-21 06:44:59')
---
  def create
    @room_type = RoomType.new(room_type_params)
    if @room_type.save

UPDATE `room_types` SET `name` = 'tttsdsdsd', `updated_at` = '2016-05-21 03:47:02' WHERE `room_types`.`id` = 1
---
  def update
    if @room_type.update_attributes(room_type_params)

DELETE FROM `room_types` WHERE `room_types`.`id` = 1
---
  def destroy
    if @room_type.destroy

SELECT  `room_types`.* FROM `room_types` WHERE `room_types`.`id` = NULL LIMIT 1
---
  def find_room_type
    @room_type = RoomType.find(params[:id]) rescue nil