app/controllers/admin/users_controller.rb

  def index
    @users = User.all.order("created_at desc")
---
SELECT `users`.* FROM `users`  ORDER BY created_at desc

  def find_user
    @user = User.find(params[:id]) rescue nil
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1