app/controllers/user/bookings_controller.rb

SELECT `bookings`.* FROM `bookings` WHERE (user_id =2)  ORDER BY created_at desc
SELECT `rooms`.* FROM `rooms` WHERE `rooms`.`id` IN (1, 4, 2)
SELECT `bookings`.* FROM `bookings` WHERE ((start_date >= '2016-05-02' and start_date <= '2016-05-03') or (end_date >= '2016-05-02' and end_date <= '2016-05-03'))
---
  def index
    @bookings = Booking.includes(:room).where("user_id =?", current_user.id).order("created_at desc") if current_user.present?
    @avaible_room = Booking.search(params, "web") if params[:search].present?

SELECT  `room_types`.* FROM `room_types` WHERE `room_types`.`name` = 'Deluxe Rooms - Queen Size Bed' LIMIT 1
INSERT INTO `bookings` (`start_date`, `end_date`, `user_id`, `created_at`, `updated_at`) VALUES ('2016-05-02', '2016-05-03', 2, '2016-05-21 10:55:21', '2016-05-21 10:55:21')
UPDATE `bookings` SET `bookings`.`total_amount` = 1000 WHERE `bookings`.`id` = 10
---
  def create
    @booking = current_user.bookings.build(booking_params)
    @booking.room_type_id = RoomType.find_by_name(params[:booking][:room_type_id]).id
    if @booking.save

UPDATE `bookings` SET `start_date` = '2016-05-25', `end_date` = '2016-05-31', `updated_at` = '2016-05-21 13:35:35' WHERE `bookings`.`id` = 18
---
  def update
    if @booking.update_attributes(booking_params)

SELECT `bookings`.* FROM `bookings` WHERE ((start_date >= '2016-05-02' and start_date <= '2016-05-03') or (end_date >= '2016-05-02' and end_date <= '2016-05-03'))
---
  def find_booking
    @booking = Booking.find(params[:id]) rescue nil