app/views/user/bookings/_form.html.haml

SELECT `room_types`.* FROM `room_types`
SELECT `rooms`.`id` FROM `rooms` WHERE `rooms`.`room_type_id` = 1
---
= form_for [:user, @booking] do |f|
  = f.collection_select :room_type_id, RoomType.all, :id, :name, {:selected => f.object.room_type_id, :prompt => "select room type"}