app/views/user/bookings/_search.html.haml

          %label{:for => "disabledSelect"} Room
          = select_tag :room_type, options_for_select(RoomType.all.collect{|c| c.name}.uniq, params[:room_type]), :class  => "form-control", :prompt => "Type Of Rooms", :id => "disabledSelect", :required => true
        .form-group.col-lg-6
---
SELECT  `room_types`.* FROM `room_types` WHERE `room_types`.`name` = 'A' LIMIT 1