app/controllers/api/v1/bookings_controller.rb

  def index
    user_booking_details = current_user.booking_details if current_user.present?
    data = [params[:room_type], params[:check_in], params[:check_out]]
    room_availability_details = Booking.search(data, "api") if data.present?
    if user_booking_details.present? and room_availability_details.present?
      render :json => {:room_availibility => [{:room_type => params[:room_type], :check_in => params[:check_in], :check_out => params[:check_out],:no_of_room => room_availability_details.first, :price_per_room => room_availability_details.last}],:total_time_room_book => user_booking_details.count, :booking_details => user_booking_details}
---
SELECT `bookings`.* FROM `bookings` WHERE `bookings`.`user_id` = 2  ORDER BY created_at desc
SELECT `rooms`.`id` FROM `rooms` WHERE `rooms`.`room_type_id` = 1

  def create
    @room_type = RoomType.find_by_id(params[:room_type])
    if @room_type.present?
      @booking = current_user.bookings.build(:room_type_id => @room_type.id, :start_date => params[:check_in], :end_date => params[:check_out], :user_id => current_user.id)
      if @booking.save
        render :status=>200, :json=>{:status=>"Success", :message=>"You have Successfully booked room."} and return
      else
        render :status => 200, :json => { :status=>"Failure",:message=>"Room booking Failed Error: #{@booking.errors.values.join(", ")}."}
---
SELECT  `room_types`.* FROM `room_types` WHERE `room_types`.`id` IS NULL LIMIT 1
INSERT INTO `bookings` (`start_date`, `end_date`, `user_id`, `created_at`, `updated_at`) VALUES ('2016-10-24', '2016-10-30', 2, '2016-10-23 16:44:27', '2016-10-23 16:44:27')
SELECT `rooms`.`id` FROM `rooms` WHERE `rooms`.`room_type_id` = 1