app/controllers/api/v1/tokens_controller.rb

  def create
    render :status=>406, :json=>{:status=>"Failure",:message=>"The request must be json"} and return if request.format != :json
    render :status=>400,:json=>{:status=>"Failure",:message=>"The request must contain the email and password."} and return if params[:email].nil? or params[:password].nil?
    @user=User.find_by_email(params[:email].downcase)
---
SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'shiv@example.com' LIMIT 1